{"keras_version": "2.0.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv3D", "config": {"dtype": "float32", "batch_input_shape": [null, 16, 112, 112, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_size": [3, 3, 3], "kernel_constraint": null, "name": "conv1", "padding": "same", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1, 1], "trainable": true, "kernel_regularizer": null, "filters": 64, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling3D", "config": {"strides": [1, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "pool1", "pool_size": [1, 2, 2]}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv2", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 128, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling3D", "config": {"strides": [2, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "pool2", "pool_size": [2, 2, 2]}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv3a", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 256, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv3b", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 256, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling3D", "config": {"strides": [2, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "pool3", "pool_size": [2, 2, 2]}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv4a", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 512, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv4b", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 512, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling3D", "config": {"strides": [2, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "pool4", "pool_size": [2, 2, 2]}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv5a", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 512, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv3D", "config": {"strides": [1, 1, 1], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "name": "conv5b", "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "filters": 512, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "ZeroPadding3D", "config": {"data_format": "channels_last", "name": "zeropad5", "trainable": true, "padding": [[0, 0], [0, 1], [0, 1]]}}, {"class_name": "MaxPooling3D", "config": {"strides": [2, 2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "name": "pool5", "pool_size": [2, 2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "name": "fc6", "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 4096, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "name": "fc7", "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 4096, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "name": "fc8", "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 487, "bias_regularizer": null, "bias_constraint": null}}]}